[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co.com/khHN7Pk/9780143454212.jpg",
    "review": "A harrowing prophecy of totalitarianism, *1984* paints a world where Big Brother's gaze never blinks and is rewritten by the minute. Winston Smith's rebellion against the Party exposes the fragility of memory and the brutal cost of dissent. Orwell's nightmare of thought police, Newspeak, and Room 101 remains terrifyingly relevant in our age of surveillance and disinformation. A masterwork that chills with its clarity about power's corruption.",
    "totalPages": 192,
    "rating": 4.5,
    "category": "Classic",
    "tags": ["Fiction", "Romance"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co.com/0cv102J/To-Kill-a-Mockingbird.webp",
    "review": "Set in the racially charged Depression-era South, Lee's novel is a poignant coming-of-age tale seen through Scout Finch's clear-eyed innocence. Her father Atticus, defending an unjustly accused Black man, embodies moral courage in the face of prejudice. Blending warmth and wrenching social commentary, the story reminds us that empathy is both a weapon and a shield against injustice.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Drama", "Social Justice"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co.com/MprDyVt/51-BIA4rrae-L-AC-UF1000-1000-QL80.jpg",
    "review": "A ghost story steeped in historical trauma, Beloved confronts the scars of slavery through Sethe, a woman haunted by the daughter she killed to spare from bondage. Morrison's lyrical prose weaves memory and magic into a tapestry of pain and resilience. The novel's unflinching portrayal of love's extremes—both destructive and redemptive—cements its place as an American classic.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co.com/tYSWRfG/catcherrye-edited-1-800x.png",
    "review": "A fable for dreamers, The Alchemist follows Santiago, a shepherd boy chasing a vision of treasure to Egypt's pyramids. Coelho's deceptively simple prose masks profound wisdom about listening to one's heart and recognizing life's omens. The desert's silence and the alchemist's riddles whisper universal truths: that the journey itself transforms us, and that the universe conspires to help those who dare.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Young Adult", "Identity"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co.com/YdQDMpn/81me-ud-V63-L-AC-UF1000-1000-QL80.jpg",
    "review": "More than Gothic horror, Shelley's masterpiece is a meditation on creation and abandonment. Dr. Frankenstein's  articulate and aching for connection, forces readers to question who the real villain is. The icy wilderness and the creature's demand for a mate mirror the human fear of loneliness. A groundbreaking novel that birthed science fiction while exposing the darkness in playing God.",
    "totalPages": 279,
    "rating": 4.7,
    "category": "Classic",
    "tags": ["Romance", "Satire"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co.com/xS8YvxL/81m-CE-uclx-L-UF1000-1000-QL80.jpg",
    "review": "A lone astronaut awakens amnesiac on a spaceship, tasked with saving Earth from a cosmic catastrophe. Weir's sci-fi romp combines The Martian's humor with first-contact thrills, as the protagonist befriends an alien resembling a spider made of jazz hands Beneath the equations and quips lies a moving tribute to curiosity and cross-species cooperation.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Epic"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co.com/989qMRW/42844155.jpg",
    "review": "Miller resurrects the witch of The Odyssey in a lush retelling that transforms a sidelined nymph into a feminist icon. Banished to an island, Circe hones her sorcery and encounters gods, sailors, and monsters. The novel's magic lies in its reinvention of power: not as dominion over others, but as self-knowledge forged in solitude. A hymn to the outsiders and late bloomers.",
    "totalPages": 309,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Young Adult"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co.com/zS9jsdK/18144590.jpg",
    "review": "In a post-apocalyptic wasteland, a father and son trek toward an uncertain coast, pushing a shopping cart of meager supplies. McCarthy's stripped-down prose mirrors the barren landscape, yet their bond—punctuated by the boy's whispered shines like embers in ash. A devastating yet tender ode to hope in humanity's darkest hour.",
    "totalPages": 177,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Philosophical", "Adventure"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 9,
    "bookName": "The Girl on the Train",
    "author": "Paula Hawkins",
    "image": "https://i.ibb.co.com/P6hfCmJ/Whats-App-Image-2024-05-22-at-11-21-25-2e21ae46.jpg",
    "review": "'The Great Gatsby' by F. Scott Fitzgerald is a timeless masterpiece that delves into the decadence and disillusionment of the Jazz Age. Set in the Roaring Twenties, the novel unveils the enigmatic Jay Gatsby's extravagant parties, masking a pursuit of lost love. Narrated by Nick Carraway, the story explores themes of wealth, love, and the American Dream, drawing readers into a vivid portrayal of the glittering yet elusive world of the East and West Egg.",
    "totalPages": 316,
    "rating": 4.2,
    "category": "Mystery",
    "tags": ["Suspense", "Psychological"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2015
  }
]
